#include <stdio.h>
#define  PI  3.1415  
int main()
{
	//1. C语言框架
	
	//2. 补码和原码 反码 如何转换  负反加一为补 
	//3. 进制的转换  --要求50以内的数 能够心算 
	//4. 要求 0-15 对应的十六进制  二进制 要会背
	//5.  常量和变量  
	//6. 转义符  \t  \n  \b   \ooo \x23  \\ \' \" 
	//  D   33          48            29           17  
	//  H   21          30            1D           11
	//  B 0010_0001  00110000     0001_1101       00010001  
	int  a,b1,c;  //整形 
    int  g,s,b,q ; //个十百千 
    float ff;

   /* printf("%d + %d = %d \n",a,b,a+b);
    printf("%d - %d = %d \n",a,b,a-b);
    printf("%d * %d = %d \n",a,b,a*b);
    printf("%d / %d = %d \n",a,b,a/b); //整形除以整形 结果一定还是整形 
    //求模  取余   
    printf("%d  %d = %d \n",a,b,a%b); // 10 % 20 = ? 
    */
    
    a = 10.3; // 10
    ff = 10; //10.00000;
	b1 = -10;
	c= -3; 
    g= a%10;
    s= a%100/10;
    b= a/100%10;
    q= a/1000;
    //如何用 /  和 % 
	// 两种运算符号来求得 变量a 1567  的千位  百位 十位 和个位 
    printf("%d :个位 %d 十位 %d 百位 %d 千位 %d \n",a,g,s,b,q);
    printf("%d\n",b1%c);
    
    
    
    
    
    
    
	return 0;
}










